@echo off

:: C:\result 폴더가 존재하지 않으면 생성
if not exist C:\result\Windows mkdir C:\result\Windows\export

echo ================================================================
echo W-07: 공유 디렉토리 내 Everyone 권한 존재 여부 점검
echo ================================================================
 

:: 공유폴더 목록 저장, 명령을 잘 실행했습니다 문구, 줄바꿈 공백 제거
net share | findstr /V /C:"명령을 잘 실행했습니다." | findstr /R /V "^$" > C:\result\Windows\export\W_07.txt

type C:\result\Windows\export\W_07.txt
echo ================================================================
echo 일반 공유 디렉토리가 없거나 공유 디렉터리 접근 권한에 Everyone 권한이 없는 경우 : ※ 결과: 양호
echo ================================================================
echo 일반 공유 디렉토리의 접근 권한에 Everyone 권한이 있는 경우  :                     ※ 결과: 취약
echo ================================================================
echo ※ 수동 점검 
echo W-07,보류 >> C:\result\Windows\result.txt
echo ================================================================

pause