@echo off

:: C:\result 폴더가 존재하지 않으면 생성
if not exist C:\result\Windows mkdir C:\result\Windows\export

echo ================================================================
echo W-08: 하드디스크 기본 공유 제거 여부 점검
echo ================================================================
 

:: 공유폴더 목록 저장, 명령을 잘 실행했습니다 문구, 줄바꿈 공백 제거
net share | findstr /V /C:"명령을 잘 실행했습니다." | findstr /R /V "^$" > C:\result\Windows\export\W_08.txt

type C:\result\Windows\export\W_08.txt
echo ================================================================
echo 하드디스크 기본 공유(C$, D$, E$, ADMIN$ 등)가 존재하지 않는 경우 : ※ 결과: 양호
echo ================================================================
echo 하드디스크 기본 공유(C$, D$, E$, ADMIN$ 등)가 존재하는 경우      : ※ 결과: 취약
echo ================================================================
echo ※ 수동 점검 
echo W-08,보류 >> C:\result\Windows\result.txt
echo ================================================================

pause