@echo off
:: C:\result 폴더가 존재하지 않으면 생성
if not exist C:\result\Windows mkdir C:\result\Windows\export

if exist C:\result\Windows\export\W_45.txt del C:\result\Windows\export\W_45.txt

echo ================================================================
echo W-45: 디스크볼륨 암호화 설정 여부 점검
echo ================================================================

echo 제어시스템 소스파일, 문서파일, 도면, ID/PW 파일 등 중요데이터를 암호화 하여 저장한 경우
echo ※ 결과: 양호
echo ================================================================
echo 제어시스템 소스파일, 문서파일, 도면, ID/PW 파일 등이 존재하나 암호화가 안 된 경우
echo ※ 결과: 취약
echo ================================================================
echo ※ 수동 점검 
echo W-45,보류 >> C:\result\Windows\result.txt

echo ================================================================

pause