@echo off
:: C:\result 폴더가 존재하지 않으면 생성
if not exist C:\result\Windows mkdir C:\result\Windows\export

:: 기존 결과 파일을 삭제하여 중복 기록 방지
if exist C:\result\Windows\export\W_62.txt del C:\result\Windows\export\W_62.txt

echo ================================================================
echo W-62: SNMP 패킷 접근 제어 설정 여부 점검
echo ================================================================

sc query "SNMPTRAP" | find "RUNNING" >nul
if %ERRORLEVEL%==0 (
    echo SNMP 서비스가 실행 중입니다.
echo ================================================================
) else (
    echo SNMP 서비스가 실행 중이지 않습니다.
echo ================================================================
)

echo [특정 호스트로부터 SNMP 패킷 받아들이기]로 설정되어 있는 경우
echo ※ 결과: 양호
echo ================================================================
echo [모든 호스트로부터 SNMP 패킷 받아들이기]로 설정되어 있는 경우
echo SNMP 서비스를 사용하지 않으나 포트(161)가 열려 있는 경우
echo ※ 결과: 취약
echo ================================================================
echo ※ 수동 점검 
echo W-62,보류 >> C:\result\Windows\result.txt
echo ================================================================

pause